//【引用模組功能】
//------------------------------------------------------------------------------>
const express = require("express");
const path = require("path"); //引用 路徑模組
const router = express.Router();
//【引用外部設定檔模組功能】
//------------------------------------------------------------------------------>

//【請求方法處理】
//------------------------------------------------------------------------------>
router.get("/", (req, res) => {
  const fileName = "sitemap.xml";
  const filePath = path.join(__dirname, "../", fileName);
  res.sendFile(filePath);
});

//【函式暴露出去】
//------------------------------------------------------------------------------>
module.exports = router;
